
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьФайла = Параметры.Путь;
	Объект.Текст = Параметры.Документ;
КонецПроцедуры

&НаКлиенте
Процедура Редактирование(Команда)
	Элементы.Текст.ТолькоПросмотр = НЕ Элементы.Текст.ТолькоПросмотр;
	Элементы.ФормаРедактирование.Пометка = НЕ Элементы.Текст.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура ПереносСтрок(Команда)
	Элементы.Текст.АвтоПереносСтрок = НЕ Элементы.Текст.АвтоПереносСтрок;
	Элементы.ФормаПереносСтрок.Пометка = Элементы.Текст.АвтоПереносСтрок;
КонецПроцедуры
