//#Если Сервер Тогда
//Процедура ПрочитатьСписокДисковСервер(ИмяЭлемента) Экспорт
//	//Элементы = ЭлементыФормы;
//	СИ = Новый СистемнаяИнформация;
//	Если СИ.ТипПлатформы = ТипПлатформы.Windows_x86 Или СИ.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
//		FSO = Новый COMОбъект("Scripting.FileSystemObject");
//		Для Каждого стр Из FSO.Drives Цикл
//			//Элементы[ИмяЭлемента].СписокВыбора.Добавить(стр.Path, ?(стр.DriveType = 3, стр.Path+" ("+стр.ShareName+")", ""),, ПолучитьКартинкуДиска(стр.DriveType));//, стр.Path + " ["+стр.VolumeName+"]");
//			Сообщить(стр.Path);
//		КонецЦикла;	
//	Иначе
//		//Элементы[ИмяЭлемента].СписокВыбора.Добавить("/");
//		//ФайлыВКорне = НайтиФайлы("/", "*");
//		//Для н=2 по ФайлыВКорне.Количество()-1 Цикл // первые две строки находит "." и " .."
//		//	Элементы[ИмяЭлемента].СписокВыбора.Добавить(ФайлыВКорне[н].ПолноеИмя);
//		//КонецЦикла; 
//	КонецЕсли;
//	
//КонецПроцедуры
//#КонецЕсли
